
print "С or F: "       #вивиодимо : Цельсій чи Фаренгейт?
str = gets						# метод gets бере рядок (той, шо ми йобнули через print). Ну і присвоюємо його в перемінну
exit if str.nil? or str.empty?  #задаємо умови виходу з прожки "вийти нахуй, якщо в str відсутнє значення''.nil може використовуватися для будь-якого обєкту. Empty - пустий рядок 
str.chomp!  #видаляємо останній символ в рядку (змінюємо сам рядок, а не створюємо новий, що походу хуйово)
temp, scale � str.split(" ") # ну split ясно блабла. А от як ми присвоюємо перемінним  - не зрозумів ніхуя
# Temp - температура. Ну це "останнє значиення" в рядку. Тоді б мало бути так scale, temp
abort "#{temp} недопустимое число." if temp !� /-?\d+/ # друкуємо повідомлення перед виходом. Ну там далі регулярка. Я не став влазити в детаді. Там де решітка і в дужках 
# перемінна - це і є інтерполяція? Ще не зрозумів нахуя там знак оклику
temp = temp.to f # число з плаваючою точкою. 
case scale # типу як switch в js. ТИпу яке із значення scale вибрано юзером
when "С", "с" # якщо вибрано C блабла. Я розумію , що c - перемінна. Їй якось динамічно присвоюється те, що ввів юзер ?
f � l.8*temp + 32 # знак питання для того, щоб обчислити значення. Ну я розумію так, типу f , яку ми обявили пізніше, обчислюється так і так. Нахуя там l?
when "F", "f"
с � (5.0/9.0)*(temp-32)
else
abort "Необходимо задать С или F."
end
if f.nil? # якщо фаренгейти не задані? Що за хуйня? А чому нема c.nil?
print "f(c} градусов C\n" # Що таке 
else  # просто виводимо наші фарангейти, і цельсії
print